import reverseNumber from '../../js/reverseNumber.js';
import startPromtOrNot from '../../js/startPromtOrNot.js';

startPromtOrNot();

// * Мінімум
// 1. Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.
console.log('Додавання 0,1 і 0,2 рівне:', +(0.1 + 0.2).toFixed(1));

// 2. Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.
const str = '1';
const num = 2;
console.log(
  "Математично правильна відповідь для додавання рядка '1' і цифри 2:",
  +str + num
);

// 3. Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.
const flashCardVolume = +prompt('Введи обсяг флешки у гігабайтах:');
console.log(
  'На флешку обсягом',
  flashCardVolume,
  'гігабайт, поміститься',
  Math.floor((flashCardVolume * 1000) / 820),
  'файлів обсягом 820 Мб.'
);

// * Норма
// 1. Користувач вводить суму грошей в гаманці і ціну однієї шоколадки. Програма виводить скільки шоколадок може купити користувач і скільки здачі у нього залишиться.
const ammountInWallet = +prompt('Введи суму грошей в гаманці:');
const chocoladePrice = +prompt('Введи ціну однієї шоколадки:');
console.log(
  'За',
  ammountInWallet,
  'гривень, ти зможеш купти',
  Math.floor(ammountInWallet / chocoladePrice),
  'шоколадки, по ціні',
  chocoladePrice,
  'гривень. Твоя решта:',
  ammountInWallet % chocoladePrice,
  'гривень.'
);

// 2. Запитай у користувача тризначне число і виведи його задом наперед. Для вирішення завдання тобі знадобиться оператор % (залишок від ділення).
// функція reverseNumber імпортована з іншого файла
console.log(
  'Число задом на перед:',
  reverseNumber(
    +prompt('Введи тризначне число, щоб вивести його задом на перед:')
  )
);

// * Максимум
// 1. Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5% річних. Вивести суму нарахованих відсотків.
const depositAmount = prompt('Яку суму ви бажаєте вкласти під 5% річних?');
console.log(
  'За два місяці ви отримаєте',
  +((((depositAmount / 100) * 5) / 12) * 2).toFixed(2),
  'гривень з нарахованих відсотків.'
);

// 2. Що повернуть вирази:
//  2 && 0 && 3
//  2 || 0 || 3
//  2 && 0 || 3
console.log("Вираз '2 && 0 && 3' поверне:", 2 && 0 && 3); // 0
console.log("Вираз '2 || 0 || 3' поверне:", 2 || 0 || 3); // 2
console.log("Вираз '2 && 0 || 3' поверне:", (2 && 0) || 3); // 3
