import startPromtOrNot from '../../js/startPromtOrNot.js';

startPromtOrNot();

// * Мінімум
//  1. Створи HTML-файл, в ньому пропиши всі можливі способи використання JS;
//  2. Тобі потрібно зберігати ім’я та прізвище в змінній, придумай до 4-х імен змінних, що потрібні тобі для даної задачі. Також напиши до 5 неправильних імен (неправильні імена повинні бути закоментовані);
//  3. Вкажи всі можливі способи коментування коду;
//  4. Які стилі написання імен змінних ти знаєш?

// * Норма
// 1. Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;
let userName = prompt('Окей, як тебе звати?');

console.log("І'мя користувача: " + userName);

// 2. Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу;
const currentYear = new Date().getFullYear();
let userAge =
  currentYear - prompt('Привіт, ' + userName + '! З якого ти року?');

console.log('Користувачеві:', +userAge, 'років.');

// 3. Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата.
const squareSideLenght = +prompt('Вкажи довжину сторони квадрата:');

console.log('Периметр квадрату =', squareSideLenght * 4);

// * Максимум
// 1. Запитай у користувача радіус кола і виведи площу такої окружності.
const circleRadius = +prompt('Вкажи радіус кола:');

console.log(
  'Площа окружності кола =',
  Math.trunc(Math.PI * Math.pow(circleRadius, 2))
);

// 2. Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно.
const distanceBetweenCities = +prompt('Вкажи відстань між містами:');
const inHowManyHours = +prompt(
  'За скільки годин ти хочеш добратися з одного міста в інше місто?'
);

console.log(
  'Щоб здолати відстань у',
  distanceBetweenCities,
  'км. за',
  inHowManyHours,
  'годин, тобі потрібно рухатися зі швидкістю',
  (distanceBetweenCities / inHowManyHours).toFixed(2),
  'км/год.'
);

// 3. Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. Курс валют зберігається в константі.
const currencyCourse = 0.92;
const howMuchDollars = +prompt('Скільки доларів ти хочеш поміняти в євро?');

console.log(
  'За',
  howMuchDollars,
  'доларів ти отримаєш',
  +(currencyCourse * howMuchDollars).toFixed(2),
  'євро по курсу 0.92 євро за долар.'
);
